---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StructuralSectionIshapeBoltDiameter
source: html/c98920d1-0893-6b62-2432-d8508d9989e6.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StructuralSectionIshapeBoltDiameter Property

"Bolt Diameter"

## Syntax (C#)
```csharp
public static ForgeTypeId StructuralSectionIshapeBoltDiameter { get; }
```